app/controllers/api/v1/blogs_controller.rb

      def create
        @blog = Blog.new(blog_params)

        if @blog.save
---
INSERT INTO "blogs" ("title", "body", "imgurl", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["body", ""], ["imgurl", ""], ["created_at", "2022-10-19 11:05:41.701792"], ["updated_at", "2022-10-19 11:05:41.701792"]]

      def update
        if @blog.update(blog_params)
---
UPDATE "blogs" SET "title" = ?, "body" = ?, "imgurl" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "title 2"], ["body", "dsfdsfsdfsdfds"], ["imgurl", "xyz.jpg"], ["updated_at", "2022-10-26 11:08:13.221271"], ["id", 4]]